antaris-inc/SatOS-HAL/drivers/exo_hal_driver_fw/exo_io_al_driver_api/exo_io_al_wrapper/exo_io_al_stm32f7xx/i2c/src/exo_io_al_stm32f7xx_i2c.c
/**
 * @file exo_io_al_stm32f7xx_i2c.c
 *
 * @brief This file contains wrapper function definition for I2C interface
 *
 * @copyright Copyright 2024 Antaris, Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "exo_io_al_stm32f7xx_i2c.h"
#include "exo_osal.h"
#include "exo_common.h"
#ifndef LINUX_TEMP_PORT
#include "stm32f7xx_hal.h"
#endif

I2C_HandleTypeDef hi2c1;  ///< I2C1 handler
I2C_HandleTypeDef hi2c2;  ///< I2C2 handler
I2C_HandleTypeDef hi2c3;  ///< I2C3 handler
I2C_HandleTypeDef hi2c4;  ///< I2C4 handler
HAL_StatusTypeDef i2c_sts = 0;  ///< I2C status

/**
 * @brief  This API register the I2C1 callback event
 */
void io_hal_stm32f7xx_i2c1_reg_cb();
/**
 * @brief  This API register the I2C2 callback event
 */
void io_hal_stm32f7xx_i2c2_reg_cb();
/**
 * @brief  This API register the I2C3 callback event
 */
void io_hal_stm32f7xx_i2c3_reg_cb();
/**
 * @brief  This API register the I2C4 callback event
 */
void io_hal_stm32f7xx_i2c4_reg_cb();
/**
 * @brief   This function is a master transmit complete I2C1 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c1_mst_tx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a master recieve complete I2C1 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c1_mst_rx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief   This function is a abort complete I2C1 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c1_abort_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a Listen complete I2C1 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c1_listen_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a error complete I2C1 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c1_error_cb(I2C_HandleTypeDef *hi2c);

/**
 * @brief   This function is a master transmit complete I2C2 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c2_mst_tx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a master recieve complete I2C2 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c2_mst_rx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief   This function is a abort complete I2C2 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c2_abort_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a Listen complete I2C2 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c2_listen_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a error complete I2C2 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c2_error_cb(I2C_HandleTypeDef *hi2c);

/**
 * @brief   This function is a master transmit complete I2C3 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c3_mst_tx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a master recieve complete I2C3 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c3_mst_rx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief   This function is a abort complete I2C3 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c3_abort_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a Listen complete I2C3 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c3_listen_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a error complete I2C3 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c3_error_cb(I2C_HandleTypeDef *hi2c);

/**
 * @brief   This function is a master transmit complete I2C4 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c4_mst_tx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a master recieve complete I2C4 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c4_mst_rx_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief   This function is a abort complete I2C4 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c4_abort_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a Listen complete I2C4 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c4_listen_cplt_cb(I2C_HandleTypeDef *hi2c);
/**
 * @brief  This function is a error complete I2C4 Callback event
 * @param[in]  ioal_hi2c -  pointer to a ioal_i2c_hdle structure that contains
 *                the configuration information for I2C module.
 * @retval HAL status.
 */
void io_hal_stm32f7xx_i2c4_error_cb(I2C_HandleTypeDef *hi2c);


/**
 * @brief  This API initializes the control block memory and do the basic
 * 		configurations I2C1
 */
hal_ret_sts io_hal_stm32f7xx_i2c1_init(ioal_i2c_hdle *ioal_hi2c1)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_hi2c1 != NULL)
    {
        MX_I2C1_Init(ioal_hi2c1);
        io_hal_stm32f7xx_i2c1_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}

/**
 * @brief  This API initializes the control block memory and do the basic
 * 		configurations I2C2
 */
hal_ret_sts io_hal_stm32f7xx_i2c2_init(ioal_i2c_hdle *ioal_hi2c2)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_hi2c2 != NULL)
    {
        MX_I2C2_Init(ioal_hi2c2);
        io_hal_stm32f7xx_i2c2_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}

/**
 * @brief  This API initializes the control block memory and do the basic
 * 		configurations I2C3
 */
hal_ret_sts io_hal_stm32f7xx_i2c3_init(ioal_i2c_hdle *ioal_hi2c3)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_hi2c3 != NULL)
    {
        MX_I2C3_Init(ioal_hi2c3);
        io_hal_stm32f7xx_i2c3_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}

/**
 * @brief  This API initializes the control block memory and do the basic
 * 		configurations I2C4
 */
hal_ret_sts io_hal_stm32f7xx_i2c4_init(ioal_i2c_hdle *ioal_hi2c4)
{
    hal_ret_sts ret_sts = HAL_IO_INVLD_ARG;
    if(ioal_hi2c4 != NULL)
    {
        MX_I2C4_Init(ioal_hi2c4);
        io_hal_stm32f7xx_i2c4_reg_cb();
        ret_sts = HAL_SCS;
    }
    return ret_sts;
}

/**
 * @brief  This function De initializes the I2C
 */
hal_ret_sts io_hal_stm32f7xx_i2c_deinit(ioal_i2c_hdle *ioal_hi2c)
{
    hal_ret_sts ret_sts = HAL_MAX_ERR;
    I2C_HandleTypeDef *hi2c = ioal_hi2c->intf_gen_info.vdp_intf_inst_hdle;
    //Clear I2C Error Flag
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_BERR);
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_OVR);
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_ARLO);
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_AF);
    __HAL_I2C_CLEAR_FLAG(hi2c, I2C_FLAG_TIMEOUT);
    if(HAL_OK == HAL_I2C_DeInit(hi2c))
    {
        ret_sts = HAL_SCS;
    }
    else
    {
        ret_sts = HAL_IO_VDP_ERR;
    }
    return ret_sts;
}

/**
 * @brief This function get the i2c error code
 */
uint32 io_hal_stm32f7xx_i2c_get_err(ioal_i2c_hdle *ioal_hi2c)
{
    I2C_HandleTypeDef *hi2c = ioal_hi2c->intf_gen_info.vdp_intf_inst_hdle;

    return HAL_I2C_GetError(hi2c);
}
/**
 * @brief  I2C1 Initialization function
 */
void MX_I2C1_Init(ioal_i2c_hdle *ioal_hi2c1)
{

    hi2c1.Instance = I2C1;
    hi2c1.Init.Timing = 0x20404768;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
    if (HAL_I2C_Init(&hi2c1) != HAL_OK)
    {
        ioal_error_handler();
    }

    if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)
    {
        ioal_error_handler();
    }

